[
{
    "product_url": "https://www.amazon.com/LEGO-Infinity-Gauntlet-Collectible-Building/dp/B08YP94QJN/",
    "product_name": "LEGO Marvel Infinity Gauntlet 76191 Collectible Building Kit; Thanos Right Hand Gauntlet Model with Infinity Stones (590 Pieces)",
    "meta_category": [
        "Toys & Games",
        "Building Toys",
        "Building Sets"
    ],
    "product_price": "$69.99",
    "brand_name": "Lego",
    "product_attributes": {
        "Product Dimensions": "7.52 x 13.94 x 3.58 inches",
        "Item Weight": "1.65 pounds",
        "ASIN": "B08YP94QJN",
        "Item model number": "6332680",
        "Manufacturer recommended age": "17 years and up",
        "Best Sellers Rank": "",
        "Customer Reviews": "",
        "Release date": "August 1, 2021",
        "Mfg Recommended age": "17 - 100 years",
        "Manufacturer": "LEGO"
    },
    "product_summary": "Make sure this fits\nby entering your model number. The stunning, build-and-display LEGO Marvel Infinity Gauntlet (76191) captures forever the captivating style of Marvel Studios’ Avengers: Infinity War and Avengers: Endgame movies This authentic, golden LEGO brick recreation of the iconic Infinity Gauntlet includes colorful Infinity Stones and a sturdy stand featuring a descriptive tablet This 590-piece model gives adult Marvel fans the opportunity to immerse themselves in creative construction and recreate one of comic-book culture’s most recognizable, and most devastating, weapons This stand-out, build-and-display piece makes a great birthday gift, holiday present or personal treat for any model-making enthusiast or adult fan of the Marvel Universe Measuring over 12.5 in. (31 cm) high, 5 in. (13 cm) wide and 4 in. (11 cm) deep, this fascinating model provides an attractive conversation piece, whether displayed in your home or workplace",
    "product_description": "LEGO Marvel Infinity Gauntlet (76191) is a challenging construction project that rewards the builder with an impressive display piece that perfectly evokes Marvel’s captivating style. This LEGO brick recreation of the iconic Infinity Gauntlet featured in the Marvel Studios’ Avengers: Infinity War and Avengers: Endgame movies is certain to attract attention and interest wherever it is displayed. With movable fingers, vibrantly colored Infinity Stones and a descriptive tablet attached to a sturdy base, this golden gauntlet provides an engrossing construction challenge and a finished model that will captivate all who see it. Escape the busy world and immerse yourself in the relaxing pleasure of adult LEGO building sets, perfect for anyone with an interest in creative construction or comic-book culture.",
    "suppliers_list_url": "/gp/offer-listing/B08YP94QJN/ref=dp_olp_NEW_mbc?ie=UTF8&condition=NEW",
    "image_urls": [
        "https://m.media-amazon.com/images/I/81yrQzPIRgL._AC_SL1500_.jpg",
        "https://m.media-amazon.com/images/I/71tE8BYAG4L._AC_SL1500_.jpg",
        "https://m.media-amazon.com/images/I/81HOIcUOJXS._AC_SL1500_.jpg",
        "https://m.media-amazon.com/images/I/818xS3yAxYS._AC_SL1500_.jpg",
        "https://m.media-amazon.com/images/I/81Fer8PyyGS._AC_SL1500_.jpg",
        "https://m.media-amazon.com/images/I/81-7hGxAMnL._AC_SL1500_.jpg"
    ],
    "images": [
        "images/LEGO-Infinity-Gauntlet-Collectible-Building-0.jpg",
        "images/LEGO-Infinity-Gauntlet-Collectible-Building-1.jpg",
        "images/LEGO-Infinity-Gauntlet-Collectible-Building-2.jpg",
        "images/LEGO-Infinity-Gauntlet-Collectible-Building-3.jpg",
        "images/LEGO-Infinity-Gauntlet-Collectible-Building-4.jpg",
        "images/LEGO-Infinity-Gauntlet-Collectible-Building-5.jpg"
    ]
}
]